import CatalogCategories from "./CatalogCategories/CatalogCategories";
import Categories from "./Categories/Categories";
import MainBlock from "./MainBlock/MainBlock";
import RegisterLeadBlock from "./RegisterLeadBlock/RegisterLeadBlock";

const Mainpage = () => {
  const catalogCategories = [
    {
      categoryName: "Для дома",
      data: [
        {
          type: "Спальня",
          name: "Название товара",
          description:
            "Описательная часть предмета определенной категории с какими-то характеристиками и прочим.",
          tags: ["Тег категории", "Тег категории", "Тег категории"],
        },
        {
          type: "Спальня",
          name: "Название товара",
          description:
            "Описательная часть предмета определенной категории с какими-то характеристиками и прочим.",
          tags: ["Тег категории", "Тег категории", "Тег категории"],
        },
        {
          type: "Спальня",
          name: "Название товара",
          description:
            "Описательная часть предмета определенной категории с какими-то характеристиками и прочим.",
          tags: ["Тег категории", "Тег категории", "Тег категории"],
        },
      ],
    },
    {
      categoryName: "Для офиса",
      data: [
        {
          type: "Спальня",
          name: "Название товара",
          description:
            "Описательная часть предмета определенной категории с какими-то характеристиками и прочим.",
          tags: ["Тег категории", "Тег категории", "Тег категории"],
        },
        {
          type: "Спальня",
          name: "Название товара",
          description:
            "Описательная часть предмета определенной категории с какими-то характеристиками и прочим.",
          tags: ["Тег категории", "Тег категории", "Тег категории"],
        },
        {
          type: "Спальня",
          name: "Название товара",
          description:
            "Описательная часть предмета определенной категории с какими-то характеристиками и прочим.",
          tags: ["Тег категории", "Тег категории", "Тег категории"],
        },
      ],
    },
  ];

  const newCategory = {
    categoryName: "Промышленное оборудование",
    data: [
      {
        type: "Промышленное оборудование",
        name: "Название товара",
        description:
          "Описательная часть предмета определенной категории с какими-то характеристиками и прочим.",
        tags: ["Тег категории", "Тег категории", "Тег категории"],
      },
      {
        type: "Промышленное оборудование",
        name: "Название товара",
        description:
          "Описательная часть предмета определенной категории с какими-то характеристиками и прочим.",
        tags: ["Тег категории", "Тег категории", "Тег категории"],
      },
      {
        type: "Промышленное оборудование",
        name: "Название товара",
        description:
          "Описательная часть предмета определенной категории с какими-то характеристиками и прочим.",
        tags: ["Тег категории", "Тег категории", "Тег категории"],
      },
    ],
  };
  const newCategoryy = {
    categoryName: "Полупромышленное оборудование",
    data: [
      {
        type: "Полупромышленное оборудование",
        name: "Название товара",
        description:
          "Описательная часть предмета определенной категории с какими-то характеристиками и прочим.",
        tags: ["Тег категории", "Тег категории", "Тег категории"],
      },
      {
        type: "Полупромышленное оборудование",
        name: "Название товара",
        description:
          "Описательная часть предмета определенной категории с какими-то характеристиками и прочим.",
        tags: ["Тег категории", "Тег категории", "Тег категории"],
      },
      {
        type: "Полупромышленное оборудование",
        name: "Название товара",
        description:
          "Описательная часть предмета определенной категории с какими-то характеристиками и прочим.",
        tags: ["Тег категории", "Тег категории", "Тег категории"],
      },
    ],
  };

  return (
    <main className="flex flex-col gap-8 xl:gap-20 mt-4 py-8 xl:py-20">
      <MainBlock />
      {catalogCategories.map((category) => {
        return <CatalogCategories {...category} key={category.categoryName} />;
      })}
      <RegisterLeadBlock />
      <Categories />
      <CatalogCategories {...newCategory} />
      <CatalogCategories {...newCategoryy} />
    </main>
  );
};

export default Mainpage;
